<?php
/* 3.29. Записать условие, которое является истинным, когда:
а) каждое из чисел X и Y нечетное;
б) только одно из чисел X и Y меньше 20;
в) хотя бы одно из чисел X и Y равно нулю;
г) каждое из чисел X, Y, Z отрицательное;
д) только одно из чисел X, Y и Z кратно пяти;
е) хотя бы одно из чисел X, Y, Z больше 100.
*/

$X = 10;
$Y = 22;
$Z = 30;
$task = '';

function printResult($task):void
{
    printf("Условие задачи $task истинно");
}

$task = 'а';
if (($X %2 != 0) && ($Y % 2 != 0)) {
    printResult($task);
}

$task = 'б';
if ((($X < 20) && ($Y >20)) || (($Y <20) && ($X > 20))) {
    printResult($task);
}

$task = 'в';
if (($X == 0) || ($Y == 0)) {
    printResult($task);
}

$task = 'г';
if (($X < 0) && ($Y < 0) && ($Z < 0)) {
    printResult($task);
}

$task = 'д';
if ( ($X % 5 == 0) && ($Y % 5 != 0) && ($Z % 5 != 0) ||
    ($Y % 5 ==0 ) && ($X % 5 != 0) && ($Z % 5 !=0) ||
    ($Z % 5 == 0) && ($Y % 5 != 0) && ($X % 5 != 0)) {
    printResult($task);
}

$task = 'е';
if (($X > 100) || ($Y > 100) && ($Z > 100)) {
    printResult($task);
}

